Modul7/PRAK701/CI4/app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function prosesLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $this->userModel->where('username', $username)->first();