Modul7/PRAK701/CI4/app/Controllers/Buku.php

SELECT *
FROM `buku`
ORDER BY `created_at` DESC
---
    public function index(): string
    {
        $data = [
            'title'  => 'Daftar Buku | PRAK701',
            'active' => 'buku',
            'buku'   => $this->bukuModel->orderBy('created_at', 'DESC')->findAll(),

INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`, `created_at`, `updated_at`) VALUES ('Laskar Pelangi', 'Andrea Hinata', 'Benatang Pustaka', '2005', '2026-06-05 07:29:06', '2026-06-05 07:29:06')
---
                 . view('templates/footer');
        }

        $this->bukuModel->save([
            'judul'        => $this->request->getPost('judul'),
            'penulis'      => $this->request->getPost('penulis'),
            'penerbit'     => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = 2
---
    public function edit(int $id): string
    {
        $buku = $this->bukuModel->find($id);